db = db.getSiblingDB('my_database');

db.universities.insertMany([
  {
    name: "Московский институт радиотехники, электроники и автоматики (МИРЭА)",
    institutes: [
      {
        name: "Институт информационных технологий",
        departments: [
          { name: "Кафедра программного обеспечения" },
          { name: "Кафедра радиотехники" }
        ]
      },
      {
        name: "Институт искусственного интеллекта",
        departments: [
          { name: "Кафедра автоматического управления" }
        ]
      },
      {
        name: "Институт радиоэлектроники и информатики",
        departments: []
      },
      {
        name: "Институт кибербезопасноти и цифровых технологий",
        departments: []
      },
      {
        name: "Институт технологий управления",
        departments: []
      },
      {
        name: "Институт тонких химических технологий им. М.В. Ломоносова",
        departments: []
      },
      {
        name: "Институт перспективных технологий и индустриального программирования",
        departments: []
      }
    ]
  }
]);